export const CPU_DICTIONARY: Record<string, string[]> = {
    あ: ["あさひ", "あひる", "あくび", "あんぱん"],
    い: ["いか", "いす", "いろり", "いんかん"],
    う: ["うさぎ", "うちわ", "うでどけい", "うどん"],
    え: ["えのき", "えかき", "えんぴつ", "えほん"],
    お: ["おに", "おかね", "おんがく", "おでん"],

    か: ["かがみ", "かさ", "かいすいよく", "かびん"],
    き: ["きつね", "きもの", "きせつ", "きりん"],
    く: ["くつした", "くらげ", "くしゃみ", "くうかん"],
    け: ["けしごむ", "けむり", "けいと", "けん"],
    こ: ["こおり", "こねこ", "こたつ", "こうえん"],

    さ: ["さかな", "さいふ", "さんぽ", "さんにん"],
    し: ["しまうま", "しろくま", "しっぽ", "しゃしん"],
    す: ["すいか", "すずめ", "すいとう", "すいぶん"],
    せ: ["せかい", "せんぷうき", "せなか", "せいねん"],
    そ: ["そら", "そうじき", "そつぎょう", "そうめん"],

    た: ["たまご", "たいこ", "たんぽぽ", "たいへん"],
    ち: ["ちきゅう", "ちいき", "ちから", "ちん"],
    つ: ["つき", "つくえ", "つばさ", "つうしん"],
    て: ["てがみ", "てぶくろ", "てんき", "てん"],
    と: ["とけい", "とんぼ", "とかげ", "とうばん"],

    な: ["なつ", "なみだ", "なべ", "なんばん"],
    に: ["にわとり", "にんぎょう", "にじ", "にんげん"],
    ぬ: ["ぬりえ", "ぬいぐるみ", "ぬま"],
    ね: ["ねこ", "ねずみ", "ねぶそく", "ねだん"],
    の: ["のはら", "のみもの", "のうえん"],

    は: ["はさみ", "はなび", "はんこ", "はん"],
    ひ: ["ひこうき", "ひまわり", "ひつじ", "ひがん"],
    ふ: ["ふえ", "ふくろ", "ふね", "ふうせん"],
    へ: ["へや", "へいわ", "へそ", "へん"],
    ほ: ["ほし", "ほうき", "ほたる", "ほん"],

    ま: ["まくら", "まほう", "まつり", "まんてん"],
    み: ["みず", "みなと", "みみ", "みかん"],
    む: ["むし", "むぎ", "むら", "むほん"],
    め: ["めがね", "めだか", "めいろ", "めん"],
    も: ["もも", "もじ", "もくば", "もめん"],

    や: ["やま", "やさい", "やおや", "やかん"],
    ゆ: ["ゆき", "ゆびわ", "ゆめ", "ゆうびん"],
    よ: ["よる", "よぞら", "よふかし", "よかん"],

    ら: ["らじお", "らっぱ", "らくだ", "らいねん"],
    り: ["りす", "りゆう", "りんご", "りんじん"],
    る: ["るす", "るいじ"],
    れ: ["れいぞうこ", "れきし", "れんこん"],
    ろ: ["ろうそく", "ろば"],

    わ: ["わに", "わたがし"],

    が: ["がっこう", "がか", "がまん"],
    じ: ["じゆう", "じかん"],
    ば: ["ばら", "ばった", "ばん"],
    だ: ["だんご", "だるま", "だいこん"],
    ご: ["ごみ", "ごりら", "ごはん"],
    ず: ["ずつう", "ずかん"],
};
